package com.yhl.see.core.util;

/**
 */
public class CodecUtil {

    // 大端字节序列
    public static byte[] int2bytes(int i) {
        // 先写高位，再写低位
        // 高->低 [00000000 00000000 00000000 00000100]
        // 步骤1：把最高位移到最右边，转换为byte
        // 步骤2：把第二高位移到最右边，转为byte
        // 步骤3：把第三高位移到最右边，转为byte
        // 步骤4：把最后一位移到最右边，转为byte
        byte[] bytes = new byte[4];
        // 8的右移结果[00000000 00000000 00000000 00000000] 转byte值为[00000000]
        bytes[0] = (byte) (i >> 3 * 8);
        // 8的右移结果[00000000 00000000 00000000 00000000] 转byte值为[00000000]
        bytes[1] = (byte) (i >> 2 * 8);
        // 8的右移结果[00000000 00000000 00000000 00000000] 转byte值为[00000000]
        bytes[2] = (byte) (i >> 1 * 8);
        // 8的右移结果[00000000 00000000 00000000 00000100] 转byte值为[00000100]
        bytes[3] = (byte) (i >> 0 * 8);
        return bytes;
    }
}
